app/controllers/documents_controller.rb

INSERT INTO `documents` (`updated_at`, `name`, `html`, `created_at`) VALUES ('2010-12-21 07:12:29', '1292915549', '<body><p changed=\"1\" id=\"1\" line_id=\"1\" active=\"true\">a This is a test - think<br></p><ul><li changed=\"1\" id=\"2\" line_id=\"2\" active=\"true\">a the letter \'a\' i am using <ul> <li changed=\"2\" id=\"3\" line_id=\"3\" active=\"true\">a just to keep track [EDIT]</li> <li changed=\"1\" id=\"4\" line_id=\"4\" active=\"false\">a of things that are saved on the first</li> <li changed=\"1\" id=\"5\" line_id=\"5\" active=\"false\" delete=\'true\' style=\"display:none\">a run through</li> <li changed=\"2\" id=\"7\" line_id=\"7\" active=\"false\">b includes two augmentation nodes</li> <li changed=\"3\" id=\"9\" line_id=\"\" active=\"true\">c a little more augmentation</li> </ul> </li><li changed=\"1\" id=\"6\" line_id=\"6\" active=\"true\">a where as items that begin with</li></ul> <p changed=\"2\" id=\"8\" line_id=\"8\" active=\"true\">b will be included on the second request<br></p><ul><li changed=\"3\" id=\"10\" line_id=\"\" active=\"false\">c augmentation! <ul> <li changed=\"3\" id=\"11\" line_id=\"\" active=\"false\">c yeah</li> <li changed=\"3\" id=\"12\" line_id=\"\" active=\"true\">c augment me</li> <li changed=\"3\" id=\"13\" line_id=\"\" active=\"false\">c yea heck yeah augmentation</li> </ul> </li></ul></body>', '2010-12-21 07:12:29')
SELECT `documents`.* FROM `documents` WHERE (`documents`.`name` = 'chris') LIMIT 1
UPDATE `documents` SET `updated_at` = '2010-12-21 09:00:13', `html` = '<body><p changed=\"1\" id=\"1\" line_id=\"1\" active=\"true\">a This is a test - think<br></p><ul><li changed=\"1\" id=\"2\" line_id=\"2\" active=\"true\">a the letter \'a\' i am using <ul> <li changed=\"2\" id=\"3\" line_id=\"3\" active=\"true\">a just to keep track [EDIT]</li> <li changed=\"1\" id=\"4\" line_id=\"4\" active=\"false\">a of things that are saved on the first</li> <li changed=\"1\" id=\"5\" line_id=\"5\" active=\"false\" delete=\'true\' style=\"display:none\">a run through</li> <li changed=\"2\" id=\"7\" line_id=\"7\" active=\"false\">b includes two augmentation nodes</li> <li changed=\"3\" id=\"9\" line_id=\"\" active=\"true\">c a little more augmentation</li> </ul> </li><li changed=\"1\" id=\"6\" line_id=\"6\" active=\"true\">a where as items that begin with</li></ul> <p changed=\"2\" id=\"8\" line_id=\"8\" active=\"true\">b will be included on the second request<br></p><ul><li changed=\"3\" id=\"10\" line_id=\"\" active=\"false\">c augmentation! <ul> <li changed=\"3\" id=\"11\" line_id=\"\" active=\"false\">c yeah</li> <li changed=\"3\" id=\"12\" line_id=\"\" active=\"true\">c augment me</li> <li changed=\"3\" id=\"13\" line_id=\"\" active=\"false\">c yea heck yeah augmentation</li> </ul> </li></ul></body>' WHERE (`documents`.`id` = 16)
INSERT INTO `lines` (`updated_at`, `text`, `document_id`, `line_number`, `parent_id`, `created_at`) VALUES ('2010-12-21 08:25:35', 'root', NULL, NULL, NULL, '2010-12-21 08:25:35')
---
  def create(name = nil,html = nil)

    @html = params[:html]
    @name = params[:name]
    return

    # TEST DATA
    name = 'chris'
    html = '<body><p changed="1" id="1" line_id="1" active="true">a This is a test - think<br></p><ul><li changed="1" id="2" line_id="2" active="true">a the letter \'a\' i am using <ul> <li changed="2" id="3" line_id="3" active="true">a just to keep track [EDIT]</li> <li changed="1" id="4" line_id="4" active="false">a of things that are saved on the first</li> <li changed="1" id="5" line_id="5" active="false" delete=\'true\' style="display:none">a run through</li> <li changed="2" id="7" line_id="7" active="false">b includes two augmentation nodes</li> <li changed="3" id="9" line_id="" active="true">c a little more augmentation</li> </ul> </li><li changed="1" id="6" line_id="6" active="true">a where as items that begin with</li></ul> <p changed="2" id="8" line_id="8" active="true">b will be included on the second request<br></p><ul><li changed="3" id="10" line_id="" active="false">c augmentation! <ul> <li changed="3" id="11" line_id="" active="false">c yeah</li> <li changed="3" id="12" line_id="" active="true">c augment me</li> <li changed="3" id="13" line_id="" active="false">c yea heck yeah augmentation</li> </ul> </li></ul></body>'

    name = params[:name] || name
    html = params[:html] || html

    return if name.blank? || html.blank?

    @document = Document.find_or_create_by_name(name)

    if @document.html.blank?
      @document.update_attribute(:html,html)
      @docparser = DocumentParser.new(html)
      @document.lines << @docparse.lines

SELECT `documents`.* FROM `documents` WHERE (`documents`.`name` = 'chris') LIMIT 1
---
  def update

    name = "chris"
    html = '<body><p changed="4" id="1" line_id="1" active="true">a This is a test - think<br></p><ul><li changed="1" id="2" line_id="2" active="true">a the letter \'a\' i am using <ul> <li changed="2" id="3" line_id="3" active="true">a just to keep track [EDIT]</li> <li changed="1" id="4" line_id="4" active="false">a of things that are saved on the first</li> <li changed="1" id="5" line_id="5" active="false" delete=\'true\' style="display:none">a run through</li> <li changed="2" id="7" line_id="7" active="false">b includes two augmentation nodes</li> <li changed="3" id="9" line_id="" active="true">c a little more augmentation</li> </ul> </li><li changed="1" id="6" line_id="6" active="true">a where as items that begin with</li></ul> <p changed="2" id="8" line_id="8" active="true">b will be included on the second request<br></p><ul><li changed="3" id="10" line_id="" active="false">c augmentation! <ul> <li changed="3" id="11" line_id="" active="false">c yeah</li> <li changed="3" id="12" line_id="" active="true">c augment me</li> <li changed="3" id="13" line_id="" active="false">c yea heck yeah augmentation</li> </ul> </li></ul></body>'

    name = params[:name] || name
    doc = Document.where("name = ?",name).first