app/controllers/documents_controller.rb

INSERT INTO `mems` (`updated_at`, `created_at`, `line_id`, `status`, `strength`) VALUES ('2010-12-22 05:04:43', '2010-12-22 05:04:43', NULL, NULL, 0.5)
---
  def create

    #get tag if none provided
    tag_id = params[:tag_id]
    if tag_id.nil?
      @tag = Tag.find_by_misc(true) #@todo should query by user_id too

      #generate miscelaneous tag if none
      if @tag.blank?
        @tag = Tag.create(:misc => true, :name => 'Misc')

INSERT INTO `lines` (`updated_at`, `text`, `parent_id`, `created_at`, `line_number`, `document_id`) VALUES ('2010-12-22 04:59:52', 'root', NULL, '2010-12-22 04:59:52', NULL, NULL)
SELECT `lines`.* FROM `lines` WHERE (`lines`.document_id = 101) AND (line_number = '1')
UPDATE `documents` SET `html` = '<body><p changed=\"1\" id=\"1\" line_id=\"1\" active=\"true\">a This is a test - think<br></p><ul><li changed=\"2\" id=\"2\" line_id=\"2\" active=\"true\">a the letter \'a\' i am using <ul> <li changed=\"2\" id=\"3\" line_id=\"3\" active=\"true\">a just to keep track [EDIT]</li> <li changed=\"3\" id=\"4\" line_id=\"4\" active=\"false\">a of things that are saved on the first</li> <li changed=\"1\" id=\"5\" line_id=\"5\" active=\"false\" delete=\'true\' style=\"display:none\">a run through</li> <li changed=\"2\" id=\"7\" line_id=\"7\" active=\"false\">b includes two augmentation nodes</li> <li changed=\"3\" id=\"9\" line_id=\"\" active=\"true\">c a little more augmentation</li> </ul> </li><li changed=\"1\" id=\"6\" line_id=\"6\" active=\"true\">a where as items that begin with</li></ul> <p changed=\"2\" id=\"8\" line_id=\"8\" active=\"true\">b will be included on the second request<br></p><ul><li changed=\"3\" id=\"10\" line_id=\"\" active=\"false\">c augmentation! <ul> <li changed=\"3\" id=\"11\" line_id=\"\" active=\"false\">c yeah</li> <li changed=\"3\" id=\"12\" line_id=\"\" active=\"true\">c augment me</li> <li changed=\"3\" id=\"13\" line_id=\"\" active=\"false\">c yea heck yeah augmentation</li> </ul> </li></ul></body>', `updated_at` = '2010-12-22 04:13:15' WHERE (`documents`.`id` = 101)
UPDATE `lines` SET `text` = 'a This is a mutha fucking test - think', `updated_at` = '2010-12-22 05:01:47' WHERE (`lines`.`id` = 680)
---
  def update(name = nil, html = nil)

    id = params[:id] || id
    html = params[:html] || html
    name = params[:name] || name
    @document = Document.find_by_id(id)
    return nil if id.blank? || html.blank? || @document.blank?

    # create new Nokogiri nodeset
    dp = DocumentParser.new(html)

    # pull all existing document line
    existing_lines = @document.lines

    root = Line.find_or_create_by_document_id( :document_id => @document.id,
                                               :domid => Line.dom_id(0),
                                               :text => "root" )

    Line.update_line(dp.doc,existing_lines) unless @document.html.blank?